Model: "net"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
double_conv2d_bn (double_con multiple                  9760      
_________________________________________________________________
double_conv2d_bn_1 (double_c multiple                  55808     
_________________________________________________________________
double_conv2d_bn_2 (double_c multiple                  222208    
_________________________________________________________________
double_conv2d_bn_3 (double_c multiple                  886784    
_________________________________________________________________
double_conv2d_bn_4 (double_c multiple                  3543040   
_________________________________________________________________
multi_head_attention (MultiH multiple                  0 (unused)
_________________________________________________________________
multi_head_attention_1 (Mult multiple                  0 (unused)
_________________________________________________________________
multi_head_attention_2 (Mult multiple                  0 (unused)
_________________________________________________________________
multi_head_attention_3 (Mult multiple                  0 (unused)
_________________________________________________________________
multi_head_attention_4 (Mult multiple                  25124     
_________________________________________________________________
deconv2d_bn (deconv2d_bn)    multiple                  1180672   
_________________________________________________________________
deconv2d_bn_1 (deconv2d_bn)  multiple                  590848    
_________________________________________________________________
deconv2d_bn_2 (deconv2d_bn)  multiple                  590848    
_________________________________________________________________
deconv2d_bn_3 (deconv2d_bn)  multiple                  295424    
_________________________________________________________________
deconv2d_bn_4 (deconv2d_bn)  multiple                  147968    
_________________________________________________________________
deconv2d_bn_5 (deconv2d_bn)  multiple                  147968    
_________________________________________________________________
deconv2d_bn_6 (deconv2d_bn)  multiple                  73984     
_________________________________________________________________
deconv2d_bn_7 (deconv2d_bn)  multiple                  37120     
_________________________________________________________________
deconv2d_bn_8 (deconv2d_bn)  multiple                  37120     
_________________________________________________________________
deconv2d_bn_9 (deconv2d_bn)  multiple                  18560     
_________________________________________________________________
deconv2d_bn_10 (deconv2d_bn) multiple                  9344      
_________________________________________________________________
deconv2d_bn_11 (deconv2d_bn) multiple                  9344      
_________________________________________________________________
deconv2d_bn_12 (deconv2d_bn) multiple                  4672      
_________________________________________________________________
deconv2d_bn_13 (deconv2d_bn) multiple                  1184      
_________________________________________________________________
conv2d_10 (Conv2D)           multiple                  262400    
_________________________________________________________________
conv2d_11 (Conv2D)           multiple                  131328    
_________________________________________________________________
conv2d_12 (Conv2D)           multiple                  32896     
_________________________________________________________________
conv2d_13 (Conv2D)           multiple                  16448     
_________________________________________________________________
conv2d_14 (Conv2D)           multiple                  8256      
_________________________________________________________________
conv2d_15 (Conv2D)           multiple                  4128      
_________________________________________________________________
conv2d_16 (Conv2D)           multiple                  2080      
_________________________________________________________________
conv2d_17 (Conv2D)           multiple                  9         
=================================================================
Total params: 8,345,325
Trainable params: 8,338,429
Non-trainable params: 6,896
_________________________________________________________________
None
